In [48]:
import pandas as pd
import numpy as np
import seaborn as sns
sns.set()
import matplotlib.pyplot
%matplotlib inline

In [49]:
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

In [50]:
train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [51]:
test.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [52]:
train.shape

(550068, 12)

In [53]:
test.shape

(233599, 11)

In [54]:
train.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [55]:
test.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
dtype: object

In [56]:
train.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
dtype: int64

In [57]:
test.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2             72344
Product_Category_3            162562
dtype: int64

In [58]:
train['Product_Category_2'] = train['Product_Category_2'].fillna(train['Product_Category_2'].mean())
train['Product_Category_3'] = train['Product_Category_3'].fillna(train['Product_Category_3'].mean())
test['Product_Category_2'] = test['Product_Category_2'].fillna(test['Product_Category_2'].mean())
test['Product_Category_3'] = test['Product_Category_3'].fillna(test['Product_Category_3'].mean())

In [59]:
train.isnull().sum()

User_ID                       0
Product_ID                    0
Gender                        0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category_1            0
Product_Category_2            0
Product_Category_3            0
Purchase                      0
dtype: int64

In [60]:
test.isnull().sum()

User_ID                       0
Product_ID                    0
Gender                        0
Age                           0
Occupation                    0
City_Category                 0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category_1            0
Product_Category_2            0
Product_Category_3            0
dtype: int64

In [61]:
train_test_data = [train,test]

In [62]:
train['Gender'].value_counts()

M    414259
F    135809
Name: Gender, dtype: int64

In [63]:
gender_mapping = {"M": 0, "F":1}
for dataset in train_test_data:
    dataset['Gender'] = dataset['Gender'].map(gender_mapping)

In [64]:
train['Gender'].value_counts()

0    414259
1    135809
Name: Gender, dtype: int64

In [65]:
train['Age'].value_counts()

26-35    219587
36-45    110013
18-25     99660
46-50     45701
51-55     38501
55+       21504
0-17      15102
Name: Age, dtype: int64

In [66]:
age_mapping = {"26-35": 0, "36-45": 1, "18-25": 2, "46-50": 3, "51-55": 4, "55+": 5, "0-17": 6}
for dataset in train_test_data:
    dataset['Age'] = dataset['Age'].map(age_mapping)

In [67]:
train['Age'].value_counts()

0    219587
1    110013
2     99660
3     45701
4     38501
5     21504
6     15102
Name: Age, dtype: int64

In [68]:
train['City_Category'].value_counts()

B    231173
C    171175
A    147720
Name: City_Category, dtype: int64

In [69]:
city_category_mapping = {"B": 0, "C": 1, "A": 2}
for dataset in train_test_data:
    dataset['City_Category'] = dataset['City_Category'].map(city_category_mapping)

In [70]:
train['City_Category'].value_counts()

0    231173
1    171175
2    147720
Name: City_Category, dtype: int64

In [71]:
train['Stay_In_Current_City_Years'].value_counts()

1     193821
2     101838
3      95285
4+     84726
0      74398
Name: Stay_In_Current_City_Years, dtype: int64

In [72]:
Stay_In_Current_City_Years_mapping = {"1": 0, "2": 1, "3": 2, "4+": 3, "0": 4}
for dataset in train_test_data:
    dataset['Stay_In_Current_City_Years'] = dataset['Stay_In_Current_City_Years'].map(Stay_In_Current_City_Years_mapping)

In [73]:
train['Stay_In_Current_City_Years'].value_counts()

0    193821
1    101838
2     95285
3     84726
4     74398
Name: Stay_In_Current_City_Years, dtype: int64

In [74]:
from sklearn.model_selection import train_test_split

In [75]:
X = train.iloc[:, 2:11]
y = train.iloc[:,-1]

In [76]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=0)

In [77]:
X_train

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
401980,0,0,7,1,3,1,8,9.842329,12.668243
368189,0,0,14,0,1,0,8,17.000000,12.668243
181444,0,2,7,1,3,0,8,9.842329,12.668243
238822,0,2,20,2,3,1,5,8.000000,12.668243
127422,1,5,0,1,3,0,5,9.842329,12.668243
...,...,...,...,...,...,...,...,...,...
359783,0,0,7,0,3,0,6,10.000000,13.000000
152315,0,3,7,1,0,1,8,9.842329,12.668243
117952,1,3,15,1,0,1,5,9.842329,12.668243
435829,0,2,4,2,4,1,2,4.000000,12.668243
305711,0,5,17,1,4,0,8,17.000000,12.668243

In [78]:
y_train

401980     8109
368189    10071
181444     2290
238822     6889
127422     1820
          ...
359783    20054
152315     9884
117952     6991
435829    13251
305711     9905
Name: Purchase, Length: 440054, dtype: int64

In [79]:
X_test

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
41001,0,2,0,1,2,0,1,6.000000,12.668243
16151,0,4,1,2,4,0,12,9.842329,12.668243
507262,0,0,11,1,1,0,6,8.000000,15.000000
368698,0,0,7,1,3,1,1,2.000000,9.000000
353782,0,0,2,2,0,1,5,14.000000,12.668243
...,...,...,...,...,...,...,...,...,...
168473,0,1,7,2,0,0,8,9.842329,12.668243
246358,0,1,7,1,0,1,5,9.842329,12.668243
105766,0,1,0,0,2,0,1,2.000000,16.000000
40384,0,0,7,0,0,1,1,2.000000,9.000000
181039,0,1,11,0,0,0,6,8.000000,10.000000

In [80]:
y_test

41001     15228
16151      1088
507262    16426
368698    12042
353782     8699
          ...
168473     8026
246358     8762
105766    19456
40384     19586
181039    16544
Name: Purchase, Length: 110014, dtype: int64

In [81]:
from sklearn.ensemble import RandomForestRegressor

regressor = RandomForestRegressor(n_estimators=50, random_state=0)
regressor.fit(X_train, y_train)
y_pred = regressor.predict(X_test)

In [82]:
from sklearn import metrics

print('Mean Absolute Error:', metrics.mean_absolute_error(y_test, y_pred))
print('Mean Squared Error:', metrics.mean_squared_error(y_test, y_pred))
print('Root Mean Squared Error:', np.sqrt(metrics.mean_squared_error(y_test, y_pred)))

Mean Absolute Error: 2214.162406189795
Mean Squared Error: 9268881.370969843
Root Mean Squared Error: 3044.4837609962456

In [83]:
y_pred

array([15072.96566667,  1186.74966667, 15820.80833333, ...,
       15991.40108297, 14955.22748496, 15316.611     ])

In [84]:
y_test

41001     15228
16151      1088
507262    16426
368698    12042
353782     8699
          ...
168473     8026
246358     8762
105766    19456
40384     19586
181039    16544
Name: Purchase, Length: 110014, dtype: int64

In [85]:
submission=pd.read_csv("sample_submission_V9Inaty.csv")

In [88]:
submission['Product_ID']=test['Product_ID']
submission['User_ID']=test['User_ID']

In [90]:
test = test.drop('Product_ID', axis=1)

In [91]:
test = test.drop('User_ID', axis=1)

In [92]:
pred_test = regressor.predict(test)

In [93]:
submission['Purchase']=pred_test

In [94]:
pd.DataFrame(submission, columns=['User_ID','Product_ID','Purchase']).to_csv('logistic.csv')